Cases/0.5mps/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2312
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "alpha.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          1;
    }

    "p_rgh.*"
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DIC;
    }

    "(U|T|k|omega).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2; // 상변화 팽창 대응을 위해 2회 이상 권장
    nCorrectors       2;
    nNonOrthogonalCorrectors 1;
    
    limitTemperature  true;
    TMin              200;  
    TMax              2500; 
}


relaxationFactors
{
    fields
    {
        p_rgh           0.3;
        p_rghFinal      1.0;
    }
    equations
    {
        "U.*"               0.5;
        "T.*"               0.5;
        "k.*"               0.7;
        "omega.*"           0.7;
    }
}